// Запитай ім’я користувача та виведи у відповідь “Привіт, *ім’я*”;
let nameUser = prompt('Вкажіть своє ім`я:');
alert(`Привіт, ${nameUser}`);
// 
// 
// Запитай рік народження користувача, порахуй його/її вік і виведи результат. Поточний рік вкажи в коді як константу;
const CURRENT_YEAR = 2022;
let age = prompt('Введіть Ваш рік народженя:');
alert(`Вам ${CURRENT_YEAR - age} р.`);
// 
// 
// Запитай у користувача довжину сторони квадрату і виведи периметр цього квадрата
let length = prompt('Введіть довжину сторони квадрата');
alert(`Периметр квадрата = ${length * 4}`);
// 
// 
// Запитай у користувача радіус кола і виведи площу такої окружності.
let radius = prompt('Вкажіть радіус кола:');
alert(`Площа кола = ${(Math.PI * Math.pow(radius,2)).toFixed(2)}`);
// 
// 
// Запитай у користувача відстань в кілометрах між двома містами і за скільки годин він хоче дістатися. Порахуй швидкість, з якою необхідно рухатися, щоб встигнути вчасно.
let distance = prompt('Впишіть відстань в км між двома містами:');
let time = prompt('За скільки часу Ви плануєте дістатися з одого міста в інше? (в годинах)');
let speed = distance / time;
alert(`Потрібна швидкість - ${speed.toFixed(2)} км/год`);
// 
// 
// Реалізуй конвертор валют. Користувач вводить долари, програма переводить їх в євро. Курс валют зберігається в константі.
const EURO = 0.89; //До $
let dollars = prompt('Введіть кількість доларів:'),
converterEuroDollar = EURO * dollars;
alert(`${converterEuroDollar.toFixed(2)} euro`);